" Here are my scores and reasoning for candidate John Reimann:\n\n```json\n{\n  \"name\": \"John Reimann\",\n  \n  \"background\": {\n    \"score\": 50, \n    \"reasoning\": \"Reimann has experience as a union carpenter, which aligns with this voter's pro-labor values. However, he lacks any government experience, which may be a downside.\"\n  },\n\n  \"platform\": {\n    \"score\": 90,\n    \"reasoning\": \"Reimann's socialist platform and focus on grassroots change matches this progressive voter's priorities around economic equality, public services, and community-driven policies.\"\n  },\n\n  \"stance_on_key_issues\": {\n    \"score\": 80, \n    \"reasoning\": \"Reimann's stances on housing, homelessness, public transit, education, public markets, and social justice closely match this voter's priorities.\"\n  },\n  \n  \"detail_on_key_issues\": {\n    \"Affordable housing\": {\n      \"score\": 90,\n      \"reasoning\": \"His call for massive publicly-owned housing aligns with this voter's support for government intervention on housing.\"\n    },\n    \"Homelessness\": {\n      \"score\": 80,  \n      \"reasoning\": \"Providing services to camps matches the voter's progressive views, though disbanding camps may be needed in some cases.\"\n    },\n    \"Public safety\": {\n      \"score\": 100,\n      \"reasoning\": \"Replacing police with neighborhood committees matches the voter's support for community-driven public safety.\"\n    },\n    \"Violence prevention\": {\n      \"score\": 90,\n      \"reasoning\": \"Neighborhood patrols and diffusing violent situations fits the voter's support for community programs over law enforcement.\"\n    },  \n    \"Infrastructure\": {\n      \"score\": 100,\n      \"reasoning\": \"Expanding public transit and bike lanes matches the voter's priorities.\"\n    },\n    \"Education\": {\n      \"score\": 100,\n      \"reasoning\": \"Stopping school closures and reducing class sizes perfectly aligns with the voter's education priorities.\"\n    },\n    \"Economic resilience\": {\n      \"score\": 80,\n      \"reasoning\": \"Public markets partially match the voter's focus on wealth redistribution over business growth.\"\n    },\n    \"Transportation\": {\n      \"score\": 100,  \n      \"reasoning\": \"Expanding bike lanes and free public transit is fully aligned.\"\n    },\n    \"Police accountability\": {\n      \"score\": 100,\n      \"reasoning\": \"Opposing police aligns with the voter's view on community-driven public safety.\"\n    },\n    \"City government collaboration\": {\n      \"score\": 50,\n      \"reasoning\": \"Focus on grassroots over mayor collaboration may hamper governance, though voter favors community programs.\"\n    }, \n    \"Social justice\": {\n      \"score\": 100,\n      \"reasoning\": \"Stance on publicly-owned housing matches the voter's economic equality priorities.\"\n    }\n  },\n\n  \"party_affiliation\": {\n    \"score\": 80, \n    \"reasoning\": \"No party affiliation, but identifies as socialist, which aligns reasonably well with the voter's Democratic affiliation.\"\n  },\n\n  \"major_donors_and_endorsements\": {\n    \"score\": 50,\n    \"reasoning\": \"Lack of major donors creates neutrality. Lack of endorsements hints at outsider status, which the voter may value.\"\n  },\n\n  \"local_reporting_and_coverage\": {\n    \"score\": 60, \n    \"reasoning\": \"Coverage portraying grassroots focus fits the voter's priorities, but hints at lack of ability to drive executive action.\"\n  },\n\n  \"track_record_of_integrity\": {\n    \"score\": 80,\n    \"reasoning\": \"No scandals or violations is positive, though unknown track record creates some uncertainty.\" \n  }\n\n}\n```"