" Based on the background information provided, here is my analysis of how well aligned candidate Allyssa Victory Villanueva is with the voter's values:\n\n```json\n{\n  \"name\": \"Allyssa Victory Villanueva\",\n\n  \"background\": {\n    \"score\": 60,\n    \"reasoning\": \"Villanueva's background as an Oakland native, education focused on social justice issues, and legal career holding law enforcement accountable seems reasonably well aligned with this progressive voter's values.\"\n  },\n\n  \"platform\": {\n    \"score\": 80, \n    \"reasoning\": \"Villanueva's platform of police reform, accountability, and criminal justice aligns very well with this voter's support for community programs over law enforcement.\"\n  },\n\n  \"stance_on_key_issues\": {\n    \"score\": 50,\n    \"reasoning\": \"Villanueva's general stances on affordable housing, homelessness, public safety, education, and economic opportunity are moderately aligned with this voter's progressive values.\"\n  },\n\n  \"detail_on_key_issues\": {\n    \"affordable_housing\": {\n      \"score\": 0, \n      \"reasoning\": \"No track record found on Villanueva's specific stance on affordable housing.\"\n    },\n    \"homelessness\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's specific stance on homelessness.\"\n    },\n    \"public_safety\": {\n      \"score\": 80,\n      \"reasoning\": \"Villanueva's aim to reform police while improving public safety aligns well with this voter's support for community programs over law enforcement.\"  \n    },\n    \"violence_prevention\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's specific stance on violence prevention.\"\n    },\n    \"infrastructure\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on infrastructure.\"\n    },\n    \"education\": {\n      \"score\": 80,\n      \"reasoning\": \"Villanueva's history of organizing for educational equity aligns very well with this voter's priority on education funding.\"\n    },\n    \"economic_resilience\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on economic resilience.\"\n    },\n    \"city_budget\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on city budget.\"\n    },\n    \"community_engagement\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on community engagement.\"\n    },  \n    \"environmental_policies\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on environmental policies.\"\n    },\n    \"transportation\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on transportation.\"\n    },\n    \"police_accountability\": {\n      \"score\": 100,\n      \"reasoning\": \"Villanueva's legal career focused on holding police accountable is perfectly aligned with this voter's values.\"\n    },\n    \"city_government_collaboration\": {\n      \"score\": 0,\n      \"reasoning\": \"No track record found on Villanueva's stance on city government collaboration.\"\n    },\n    \"social_justice\": {\n      \"score\": 100, \n      \"reasoning\": \"Villanueva's long record of organizing for social justice is perfectly aligned with this progressive voter's values.\"\n    }\n  },\n\n  \"party_affiliation\": {\n    \"score\": 0,\n    \"reasoning\": \"Villanueva's nonpartisan affiliation provides no information to judge alignment with this Democrat voter.\"\n  },\n\n  \"major_donors_and_endorsements\": {\n    \"score\": 0,\n    \"reasoning\": \"No major donors or endorsements found to evaluate.\"\n  },\n\n  \"local_reporting_and_coverage\": {\n    \"score\": 0, \n    \"reasoning\": \"No significant local reporting or coverage found to evaluate.\"\n  },\n   \n  \"track_record_of_integrity\": {\n    \"score\": 0,\n    \"reasoning\": \"No information found to evaluate Villanueva's personal, professional, or political integrity.\"\n  }\n\n}\n```\n\nIn summary, I've scored Villanueva's background, platform, stances on public safety, police accountability, education, and social justice as highly aligned with this progressive voter's values, but lacked information to evaluate her stance on many other key issues. Her nonpartisan status provides no insight into alignment. More information would be needed to fully evaluate her integrity and other categories. Please let me know if you would like me to clarify or expand on any part of my analysis."