" Here is my response:\n\n```json\n{\n  \"summary_of_voter\": \"\"\"\n  Based on the voter profile provided, this appears to be a very progressive voter located in Oakland, CA who strongly supports government intervention on issues like housing, healthcare, education, transportation, and the environment. The voter favors community-driven public safety over traditional law enforcement, believes in wealth redistribution, and supports policies benefitting marginalized groups like immigrants. The voter is likely to vote on economic and social justice issues and support progressive Democratic candidates who fight for major structural reforms.\n  \"\"\",\n\n  \"recommendation\": \"Sheng Thao\",\n  \n  \"ranking\": [\n    \"Sheng Thao\", \n    \"John Reimann\",\n    \"Allyssa Victory Villanueva\",\n    \"Loren Manuel Taylor\"\n  ],\n  \n  \"justification\": {\n    \"Sheng Thao\": \"\"\"\n    * Thao's progressive platform and policy positions on housing, homelessness, education, immigrant rights, healthcare, economic justice, and other issues almost perfectly match this voter's priorities (overall issue alignment score of 90/100).\n    * Thao's background as an activist and experience overcoming poverty resonates strongly with this voter's values (background score 90/100).\n    * Thao's Democratic affiliation completely matches the voter's own partisanship (100/100 party score).\n    * Her support from unions and progressive leaders like Bernie Sanders appeals to this voter (donor/endorsement score 80/100).\n    \"\"\",\n  \n    \"John Reimann\": \"\"\"\n    * Reimann's socialist platform and transformative policy proposals on housing, transit, education, and economy closely align with this progressive voter's priorities (90/100 platform score).\n    * His positions on nearly every major issue match the voter's beliefs (high 80s-100s issue scores).  \n    * His working class background appeals to the voter's values (50/100 background score).\n    * His lack of corporate ties keeps him aligned with the voter's interests (neutral donor score).\n    \"\"\",\n  \n    \"Allyssa Victory Villanueva\": \"\"\"\n    * Villanueva's background in social justice law resonates with the voter's values (60/100 background score).\n    * Her progressive stances on criminal justice reform and police accountability match this voter's support for community-driven public safety (80/100 public safety score).\n    * Her activism for educational equity appeals to the voter's education priorities (80/100 education score). \n    * Her record on many other issues is unknown, making it hard to fully assess alignment.\n    \"\"\",\n\n    \"Loren Taylor\": \"\"\"\n    * Taylor's focus on housing and homelessness is moderately aligned with the voter's priorities (60/100 platform score).\n    * His pragmatic approach to governance likely appeals to the voter (80/100 background score).\n    * However, many of his issue stances are unclear, making it hard to fully assess alignment (50/100 overall issue score).\n    * His law enforcement support misaligns with the voter's public safety views (40/100 public safety score).\n    \"\"\"\n  }\n}\n```"